# Introduction to Python - day 7 - assignment
### Gyan Krishna - 534 
### Date - 3/11/2022

### Assignment 
1. read csv files
2. maximum population which state, max area which state?
3. df.to_excel('file.xlsx', index = False, sheet_name="...");

In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [10]:
df1 = pd.read_csv('state-areas.csv')
df2 = pd.read_csv('state-abbrev.csv')
df3 = pd.read_csv('state-population.csv')

In [8]:
df1.describe()

       area (sq. mi)
count      52.000000
mean    72892.288462
std     95415.854873
min        68.000000
25%     34542.000000
50%     55375.500000
75%     83906.500000
max    656425.000000

In [11]:
df1.max()

state            Wyoming
area (sq. mi)     656425
dtype: object

In [25]:
res = df3.loc[df3['population'].idxmax()]
print(res)

state/region            USA
ages                  total
year                   2013
population      3.16129e+08
Name: 2535, dtype: object

In [29]:
df3[10:20]

   state/region     ages  year  population
10           AL    total  2007   4672840.0
11           AL  under18  2007   1132296.0
12           AL    total  2008   4718206.0
13           AL  under18  2008   1134927.0
14           AL    total  2005   4569805.0
15           AL  under18  2005   1117229.0
16           AL    total  2006   4628981.0
17           AL  under18  2006   1126798.0
18           AL    total  2004   4530729.0
19           AL  under18  2004   1113662.0

In [46]:
df = df3[df3['ages'] == 'total']
df = df[df['state/region'] != 'USA']
df.loc[df['population'].idxmax()]

state/region             CA
ages                  total
year                   2013
population      3.83325e+07
Name: 199, dtype: object

In [50]:
df2[df2['abbreviation'] == 'CA']

        state abbreviation
4  California           CA

In [56]:
a = df1[1:4]
b = df1[5:7]

c = pd.merge(a,b, how='outer')
c

         state  area (sq. mi)
0       Alaska         656425
1      Arizona         114006
2     Arkansas          53182
3     Colorado         104100
4  Connecticut           5544